app/views/recipes/_form.html.erb

    <%= f.label :category_id %>
    <%= f.select :category_id, options_for_select(Category.all.map{|s|[s.description, s.id]}) %>
---
SELECT "categories".* FROM "categories"