app/views/recipes/edit.html.erb

<%= link_to 'Show', @recipe %> |
<%= link_to 'Back', Category.find(@recipe.category_id) %>
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 32], ["LIMIT", 1]]