app/views/recipes/show.html.erb

<%= link_to 'Edit', edit_recipe_path(@recipe) %> |
<%= link_to 'Back', Category.find(@recipe.category_id) %>
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]