app/controllers/categories_controller.rb

SELECT "recipes".* FROM "recipes" WHERE "recipes"."category_id" = $1  [["category_id", 1]]
---
  def show

    @recipe = Recipe.find(params[:category_id])

INSERT INTO "categories" ("description", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["description", "Beef"], ["created_at", 2017-03-20 19:54:47 UTC], ["updated_at", 2017-03-20 19:54:47 UTC]]
---
  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save