app/controllers/recipes_controller.rb

INSERT INTO "images" ("created_at", "updated_at", "recipe_id", "image_url") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", 2017-03-22 02:47:38 UTC], ["updated_at", 2017-03-22 02:47:38 UTC], ["recipe_id", 13], ["image_url", "asdf"]]
---
def create_image
  @image = Image.new(image_params)
  @recipe = Recipe.find(params[:image][:recipe_id])
  if @image.save!

SELECT  "images".* FROM "images" WHERE "images"."recipe_id" = $1 LIMIT $2  [["recipe_id", 1], ["LIMIT", 1]]
UPDATE "images" SET "image_url" = $1, "updated_at" = $2 WHERE "images"."id" = $3  [["image_url", "http://www.fillmurray.com/200/300"], ["updated_at", 2017-03-22 23:01:20 UTC], ["id", 12]]
---
def update_image
  @image = Image.find_by(image_params)
  @recipe = Recipe.find(params[:image][:recipe_id])
  if @image.save!

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def destroy
    @category = Category.find(@recipe.category_id)