app/controllers/recipes_controller.rb

  def newingredient
    @ingredient = Ingredient.new
    @recipe = Recipe.find(params[:recipe_id])
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def newinstruction
    @instruction = Instruction.new
    @recipe = Recipe.find(params[:recipe_id])
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def editingredient
    @recipe = Recipe.find(params[:recipe_id])
    @ingredient = Ingredient.find(1)
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."recipe_id" = $1 LIMIT $2  [["recipe_id", 2], ["LIMIT", 1]]

  def create
    @recipe = Recipe.new(recipe_params)


    respond_to do |format|
      if @recipe.save
---
INSERT INTO "recipes" ("description", "created_at", "updated_at", "category_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["description", ""], ["created_at", 2017-03-20 21:01:26 UTC], ["updated_at", 2017-03-20 21:01:26 UTC], ["category_id", 2]]

  def create_ingredient
    @ingredient = Ingredient.new(ingredient_params)
    @recipe = Recipe.find(params[:ingredient][:recipe_id])
    if @ingredient.save!
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "ingredients" ("name", "created_at", "updated_at", "recipe_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "olives"], ["created_at", 2017-03-20 20:40:08 UTC], ["updated_at", 2017-03-20 20:40:08 UTC], ["recipe_id", 2]]

def create_instruction
  @instruction = Instruction.new(instruction_params)
  @recipe = Recipe.find(params[:instruction][:recipe_id])
  if @instruction.save!
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
INSERT INTO "instructions" ("step", "created_at", "updated_at", "recipe_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["step", "sdfgsdfg"], ["created_at", 2017-03-20 21:37:29 UTC], ["updated_at", 2017-03-20 21:37:29 UTC], ["recipe_id", 5]]

  def update
    respond_to do |format|
      if @recipe.update(recipe_params)
---
UPDATE "recipes" SET "description" = $1, "category_id" = $2, "updated_at" = $3 WHERE "recipes"."id" = $4  [["description", "hot dog\r\n"], ["category_id", 5], ["updated_at", 2017-03-20 21:33:31 UTC], ["id", 4]]

  def update_ingredient
    @recipe = Recipe.find(params[:ingredient][:recipe_id])
    @ingredient = Ingredient.find_by recipe_id: @recipe.id
    if @ingredient.update(ingredient_params)
---
SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."recipe_id" = $1 LIMIT $2  [["recipe_id", 5], ["LIMIT", 1]]
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
UPDATE "ingredients" SET "name" = $1, "updated_at" = $2 WHERE "ingredients"."id" = $3  [["name", "1 Ny chicken\r\narugula\r\nfeta cheese\r\nsalt\r\npepper\r\nbalsamic vinegar or some vinegar\r\nolive oil\r\nthyme\r\n4 figs halfed"], ["updated_at", 2017-03-22 22:40:24 UTC], ["id", 3]]

def update_instruction
  @instruction = Instruction.find_by(instruction_params)
  @recipe = Recipe.find(params[:instruction][:recipe_id])
  if @instruction.save!
---
SELECT  "instructions".* FROM "instructions" WHERE "instructions"."recipe_id" = $1 LIMIT $2  [["recipe_id", 10], ["LIMIT", 1]]
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "instructions" SET "step" = $1, "updated_at" = $2 WHERE "instructions"."id" = $3

    def set_ingredient
      @ingredient = Ingredient.find_by(recipe_id: @recipe.id)
---
SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."recipe_id" = $1 LIMIT $2  [["recipe_id", 12], ["LIMIT", 1]]

    def set_instruction
      @instruction = Instruction.find_by(recipe_id: @recipe.id)
---
SELECT  "instructions".* FROM "instructions" WHERE "instructions"."recipe_id" = $1 LIMIT $2  [["recipe_id", 5], ["LIMIT", 1]]