app/views/categories/show.html.erb

SELECT "recipes".* FROM "recipes" WHERE "recipes"."category_id" = $1  [["category_id", 1]]
---
    <tbody>
      <% @category.recipes.each do |recipe| %>